import {
    查看地区
} from "./查看地区";
import {
    查看地区军事
} from "./查看地区军事";
import {
    查看地区地形
} from "./查看地区地形";
import {
    查看地区生物实验室
} from "./查看地区生物实验室";
import {
    查看地区铁路
} from "./查看地区铁路";
import {
    查看地区核反应堆
} from "./查看地区核反应堆";
import {
    查看地区离心机组
} from "./查看地区离心机组";

export {
    查看地区,
    查看地区军事,
    查看地区地形,
    查看地区生物实验室,
    查看地区铁路,
    查看地区核反应堆,
    查看地区离心机组,
};

export const 查询相关指令 = [
    查看地区,
    查看地区军事,
    查看地区地形,
    查看地区生物实验室,
    查看地区铁路,
    查看地区核反应堆,
    查看地区离心机组,
];
