import { 格式化 } from "#/utils";
import type { 地区信号塔事件参数, 地区刷新事件参数, 地区权限变更事件参数 } from "./types.js";

function 构建地区刷新事件内容(参数: 地区刷新事件参数): {
    标题: string;
    内容: string;
} {
    return {
        标题: "每小时地区报告",
        内容: [
            "地区刷新已完成：",
            `■ 工业空闲刷新地区：${格式化(参数.刷新工业地区数量)}`,
            `□ 回收空闲炼钢厂：${格式化(参数.刷新炼钢空闲数量)}`,
            `□ 回收空闲电解铝厂：${格式化(参数.刷新电解铝空闲数量)}`,
        ].join("\n"),
    };
}

function 构建地区权限变更事件内容(参数: 地区权限变更事件参数): {
    标题: string;
    内容: string;
} {
    const 权限名称 = 参数.操作类型 === "设置总督" ? "地区总督" : "地区司令";
    const 权限标题 = 参数.操作类型 === "设置总督" ? "地区政务变更" : "地区军事变更";

    return {
        标题: 权限标题,
        内容: `${参数.操作者} 在 ${参数.地区名称}（${参数.地区编号}）任免${权限名称}为 ${参数.玩家名称}`,
    };
}

export function 构建地区事件内容(参数: 地区信号塔事件参数): {
    标题: string;
    内容: string;
} {
    switch (参数.类型) {
        case "refresh":
            return 构建地区刷新事件内容(参数 as 地区刷新事件参数);
        case "permission":
            return 构建地区权限变更事件内容(参数 as 地区权限变更事件参数);
        default:
            return {
                标题: "地区事件",
                内容: "发生了一个地区事件",
            };
    }
}
